       IDENTIFICATION DIVISION.
       PROGRAM-ID. ORDER-SUB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY SHARED-CPY.
       PROCEDURE DIVISION.
           STOP RUN.
