//JOB1     JOB (ACCT),'JOB1 BATCH'
//STEP1    EXEC PROC=STEPPROC
//STEP2    EXEC STEP2PROC
// INCLUDE MEMBER=COMMON
//STEP3    EXEC PGM=DIRECT
//STEP4    EXEC PROC=GHOSTPROC
//S1       EXEC MISSING
//S2       EXEC MISSING
