000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. SEQPGM.
000030* THIS IS A FULL COMMENT: COPY FAKE-SEQCPY.
000040 PROCEDURE DIVISION.
000050     COPY REAL-SEQCPY.                                            CALLZZZ
000060     CALL 'LONGCALLPART1
000070-         'PART2'.
000080     CALL WS-DYNAMIC-TARGET.
