       IDENTIFICATION DIVISION.
       PROGRAM-ID. ORDER-MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY SHARED-CPY.
       PROCEDURE DIVISION.
           CALL 'ORDER-SUB'.
           STOP RUN.
