       IDENTIFICATION DIVISION.
       PROGRAM-ID. AGENTPAY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           CALL 'COMMISUP'.
           GOBACK.
