       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTMNT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY CUSTOMER-CPY.
       PROCEDURE DIVISION.
           DISPLAY CUST-CODE.
           GOBACK.
