       IDENTIFICATION DIVISION.
       PROGRAM-ID. FEECALC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY FEE-CPY.
       PROCEDURE DIVISION.
           COMPUTE FEE-AMOUNT = PAY-AMOUNT * FEE-RATE.
           GOBACK.
