       IDENTIFICATION DIVISION.
       PROGRAM-ID. SALESUP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY INVOICE-CPY.
       PROCEDURE DIVISION.
           CALL 'TAXCALC'.
           GOBACK.
