       IDENTIFICATION DIVISION.
       PROGRAM-ID. TAXCALC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY TAX-CPY.
       PROCEDURE DIVISION.
           COMPUTE TAX-AMOUNT = INV-AMOUNT * TAX-RATE.
           GOBACK.
